In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
df = DataFrame({'kota':['Jakarta','Kuala Lumpur','Sydney'],
               'attitude':[3158,3000,2762]})
df

   attitude          kota
0      3158       Jakarta
1      3000  Kuala Lumpur
2      2762        Sydney

In [3]:
state_map = {'Jakarta':'Indonesia','Kuala Lumpur':'Malaysia','Sydney':'Australia'}

In [4]:
df['negara'] = df['kota'].map(state_map)

In [5]:
df

   attitude          kota     negara
0      3158       Jakarta  Indonesia
1      3000  Kuala Lumpur   Malaysia
2      2762        Sydney  Australia